import numpy as np

#print(np.zeros(10).dtype)
#float64

#print(np.zeros(10, dtype=int))
#[0 0 0 0 0 0 0 0 0 0]

#print(np.zeros(shape=(3,5),dtype=int))
'''
[[0 0 0 0 0]
 [0 0 0 0 0]
 [0 0 0 0 0]]
 '''

#print(np.ones((3,5)))
'''
[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]
'''

#print(np.full(shape=(3,5),fill_value=666))
'''
[[666 666 666 666 666]
 [666 666 666 666 666]
 [666 666 666 666 666]]
'''

#print(np.arange(0, 1, 0.2) )
#前闭后开区间，最后一个参数是步长 [0.  0.2 0.4 0.6 0.8]

#print(np.linspace(0,10,6))
#前闭后闭区间，最后一个参数是总共有几个数 [ 0.  2.  4.  6.  8. 10.]


#np.random.seed(123)
#random每次都不一样。代码调试的时候有时需要一样来验证结果，增加seed来保证random一样。
#print(np.random.randint(low=0, high=20, size=(3,5),dtype=int))
'''
前闭后开区间，示例中最大19
[[ 1  3 18  5  1]
 [ 7  4  3 11  9]
 [ 9 18 15  2  4]]
'''

#print(np.random.random((3,5)))
'''
[[0.51910848 0.05083835 0.4784002  0.66924388 0.04879872]
 [0.72342735 0.71198355 0.1190399  0.02867531 0.65293346]
 [0.95274168 0.12886094 0.76074144 0.10536611 0.14678627]]
'''

#正态分布随机矩阵，均值0，方差1
print(np.random.normal(loc=0, scale=1, size=(3,5)))
'''
[[-1.09103739 -0.73603967 -0.90184143  1.79194393  1.39514802]
 [-0.55279835  0.45623158 -0.82879819 -1.15633218  0.42286298]
 [-1.33752727 -0.87233875 -0.57911461 -1.1099987  -2.23845906]]
'''